![BTS](https://github.com/vfp1/bts-dsf-2020/blob/main/Logo-BTS.jpg?raw=1)

# Assignement Week 3 and 4

### Victor F. Pajuelo Madrigal <victor.pajuelo@bts.tech> - Data Science Foundations (2020-10-29)

Open this notebook in Google Colaboratory: [![Open in Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/vfp1/bts-dsf-2020/blob/main/exercises/Session_3_4_EXERCISES.ipynb)

# PANDAS

## Groupby exersises

Import this [dataset](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user)

*   What is the mean age per occupation?
*   What is the male ratio per occupation, sort it from the most to the least. Do the same for women
*   For each occupation, calculate the minimum and maximum ages
* For each combination of occupation and gender, calculate the mean age
* For each occupation present the percentage of women and men

In [9]:
import pandas as pd
import numpy as np

url1 = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

workers = pd.read_table(url1,sep='|', index_col='user_id')
workers.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

**What is the mean age per occupation?**

In [10]:
workers.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

**What is the male ratio per occupation, sort it from the most to the least. Do the same for women**

In [11]:
workers['Flag_M'] = np.where(workers['gender']=='M', 1, 0)
workers['Flag_F'] = np.where(workers['gender']=='F', 1, 0)
workers.head()

         age gender  occupation zip_code  Flag_M  Flag_F
user_id
1         24      M  technician    85711       1       0
2         53      F       other    94043       0       1
3         23      M      writer    32067       1       0
4         24      M  technician    43537       1       0
5         33      F       other    15213       0       1

Ratio for Male

In [12]:
m = workers.groupby('occupation').Flag_M.sum() / workers.occupation.value_counts() * 100 
# sort to the most  
m.sort_values(ascending = False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

Ratio for Female

In [13]:
f = workers.groupby('occupation').Flag_F.sum() / workers.occupation.value_counts() * 100 
# sort to the most  
f.sort_values(ascending = False)

homemaker        85.714286
healthcare       68.750000
librarian        56.862745
artist           46.428571
administrator    45.569620
none             44.444444
writer           42.222222
marketing        38.461538
other            34.285714
student          30.612245
educator         27.368421
salesman         25.000000
lawyer           16.666667
entertainment    11.111111
scientist         9.677419
executive         9.375000
programmer        9.090909
retired           7.142857
technician        3.703704
engineer          2.985075
doctor            0.000000
dtype: float64

**For each occupation, calculate the minimum and maximum ages**

In [14]:
workers.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

**For each combination of occupation and gender, calculate the mean age**

In [15]:
workers.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

**For each occupation present the percentage of women and men**

Count per occupation - gender

In [16]:
gender_ocup = workers.groupby(['occupation', 'gender']).agg({'gender': 'count'})
gender_ocup.head()

                      gender
occupation    gender
administrator F           36
              M           43
artist        F           13
              M           15
doctor        M            7

Count for each occupation

In [22]:
occup_count = workers.groupby(['occupation']).agg('count')
occup_count.head()

               age  gender  zip_code  Flag_M  Flag_F
occupation
administrator   79      79        79      79      79
artist          28      28        28      28      28
doctor           7       7         7       7       7
educator        95      95        95      95      95
engineer        67      67        67      67      67

Divide the gender_ocup per the occup_count and multiply per 100

In [23]:
occup_gender = gender_ocup.div(occup_count, level = "occupation") * 100
occup_gender.head(10)

                      Flag_F  Flag_M  age      gender  zip_code
occupation    gender
administrator F          NaN     NaN  NaN   45.569620       NaN
              M          NaN     NaN  NaN   54.430380       NaN
artist        F          NaN     NaN  NaN   46.428571       NaN
              M          NaN     NaN  NaN   53.571429       NaN
doctor        M          NaN     NaN  NaN  100.000000       NaN
educator      F          NaN     NaN  NaN   27.368421       NaN
              M          NaN     NaN  NaN   72.631579       NaN
engineer      F          NaN     NaN  NaN    2.985075       NaN
              M          NaN     NaN  NaN   97.014925       NaN
entertainment F          NaN     NaN  NaN   11.111111       NaN

In [24]:
occup_gender.loc[: , 'gender']

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
engineer       F           2.985075
               M          97.014925
entertainment  F          11.111111
               M          88.888889
executive      F           9.375000
               M          90.625000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         F          16.666667
               M          83.333333
librarian      F          56.862745
               M          43.137255
marketing      F          38.461538
               M          61.538462
none           F          44.444444
               M          55.555556
other          F          34.285714
               M          65.714286
programmer     F           9.090909
               M          90.909091
retired        F           7.142857
               M          92.857143
salesman       F          25.000000
               M          75.000000
scientist      F           9.677419
               M          90.322581
student        F          30.612245
               M          69.387755
technician     F           3.703704
               M          96.296296
writer         F          42.222222
               M          57.777778
Name: gender, dtype: float64

## Apply exercises

Import this [dataset](https://raw.githubusercontent.com/vfp1/bts-dsf-2020/main/data/US_Crime_Rates_1960_2014.csv)

* What is the type of the columns?
* Convert the type of the column Year to datetime64
* Set the Year column as the index of the dataframe
* Delete the Total column
* Group the year by decades and sum the values (take care with population values) 
* What is the most dangerous decade to live in the US?

In [25]:
import pandas as pd
import numpy as np

url2 = "https://raw.githubusercontent.com/vfp1/bts-dsf-2020/main/data/US_Crime_Rates_1960_2014.csv"

crime = pd.read_csv(url2)
crime.head()

   Year  Population    Total  ...  Burglary  Larceny_Theft  Vehicle_Theft
0  1960   179323175  3384200  ...    912100        1855400         328200
1  1961   182992000  3488000  ...    949600        1913000         336000
2  1962   185771000  3752200  ...    994300        2089600         366800
3  1963   188483000  4109500  ...   1086400        2297800         408300
4  1964   191141000  4564600  ...   1213200        2514400         472800

[5 rows x 12 columns]

What is the type of the columns?

In [28]:
crime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                55 non-null     int64
 1   Population          55 non-null     int64
 2   Total               55 non-null     int64
 3   Violent             55 non-null     int64
 4   Property            55 non-null     int64
 5   Murder              55 non-null     int64
 6   Forcible_Rape       55 non-null     int64
 7   Robbery             55 non-null     int64
 8   Aggravated_assault  55 non-null     int64
 9   Burglary            55 non-null     int64
 10  Larceny_Theft       55 non-null     int64
 11  Vehicle_Theft       55 non-null     int64
dtypes: int64(12)
memory usage: 5.3 KB

Convert the type of the column Year to datetime64

In [29]:
crime.Year = pd.to_datetime(crime.Year, format='%Y')
crime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                55 non-null     datetime64[ns]
 1   Population          55 non-null     int64
 2   Total               55 non-null     int64
 3   Violent             55 non-null     int64
 4   Property            55 non-null     int64
 5   Murder              55 non-null     int64
 6   Forcible_Rape       55 non-null     int64
 7   Robbery             55 non-null     int64
 8   Aggravated_assault  55 non-null     int64
 9   Burglary            55 non-null     int64
 10  Larceny_Theft       55 non-null     int64
 11  Vehicle_Theft       55 non-null     int64
dtypes: datetime64[ns](1), int64(11)
memory usage: 5.3 KB

Set the Year column as the index of the dataframe

In [30]:
crime = crime.set_index('Year', drop = True)
crime.head()

            Population    Total  ...  Larceny_Theft  Vehicle_Theft
Year                             ...
1960-01-01   179323175  3384200  ...        1855400         328200
1961-01-01   182992000  3488000  ...        1913000         336000
1962-01-01   185771000  3752200  ...        2089600         366800
1963-01-01   188483000  4109500  ...        2297800         408300
1964-01-01   191141000  4564600  ...        2514400         472800

[5 rows x 11 columns]

Delete the Total column

In [31]:
crime.drop('Total', axis=1, inplace=True)
crime.head()

            Population  Violent  ...  Larceny_Theft  Vehicle_Theft
Year                             ...
1960-01-01   179323175   288460  ...        1855400         328200
1961-01-01   182992000   289390  ...        1913000         336000
1962-01-01   185771000   301510  ...        2089600         366800
1963-01-01   188483000   316970  ...        2297800         408300
1964-01-01   191141000   364220  ...        2514400         472800

[5 rows x 10 columns]

Group the year by decades and sum the values (take care with population values)

         Uses resample to sum each decade

In [32]:
crimes = crime.resample('10AS').sum()
crimes.head()

            Population   Violent  ...  Larceny_Theft  Vehicle_Theft
Year                              ...
1960-01-01  1915053175   4134930  ...       26547700        5292100
1970-01-01  2121193298   9607930  ...       53157800        9739900
1980-01-01  2371370069  14074328  ...       72040253       11935411
1990-01-01  2612825258  17527048  ...       77679366       14624418
2000-01-01  2947969117  13968056  ...       67970291       11412834

[5 rows x 10 columns]

         We need to calcule population again (Max value)

In [35]:
population = crime['Population'].resample('10AS').max()
population.head()

Year
1960-01-01    201385000
1970-01-01    220099000
1980-01-01    248239000
1990-01-01    272690813
2000-01-01    307006550
Freq: 10AS-JAN, Name: Population, dtype: int64

      Finally, we replace the value to have the correct value.

In [34]:
crimes['Population'] = population

crimes.head()

            Population   Violent  ...  Larceny_Theft  Vehicle_Theft
Year                              ...
1960-01-01   201385000   4134930  ...       26547700        5292100
1970-01-01   220099000   9607930  ...       53157800        9739900
1980-01-01   248239000  14074328  ...       72040253       11935411
1990-01-01   272690813  17527048  ...       77679366       14624418
2000-01-01   307006550  13968056  ...       67970291       11412834

[5 rows x 10 columns]

What is the most dangerous decade to live in the US?

In [36]:
crime.idxmax(0)

Population           2014-01-01
Violent              1992-01-01
Property             1991-01-01
Murder               1991-01-01
Forcible_Rape        1992-01-01
Robbery              1991-01-01
Aggravated_assault   1993-01-01
Burglary             1980-01-01
Larceny_Theft        1991-01-01
Vehicle_Theft        1991-01-01
dtype: datetime64[ns]

# SQLite and Pandas

## SQLite, Pandas and the world of tips

Given [this](https://github.com/vfp1/bts-dsf-2020/blob/main/data/tips.csv) CSV file. Do the following:

* Load it in Pandas
* Save the `DataFrame` as SQLite
* Reply the following questions by slicing the SQLite database with SQL queries and then using Pandas for analysis:
    * Who is most likely to receive a tip during weekday? A Female or a Male? 
        * And during weekends?
    * What is the table size that is most likely to bring a better tip?
    * Who are giving more tips, smokers or non smokers?

Load it in Pandas

In [39]:
import pandas as pd
import numpy as np

url3 = 'https://github.com/vfp1/bts-dsf-2020/raw/main/data/tips.csv'

tips = pd.read_csv(url3)
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Save the DataFrame as SQLite

In [40]:
import sqlite3

cnx = sqlite3.connect('tips.db')
tips.to_sql(name='tips', con=cnx)

In [51]:
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

Functions

In [42]:
import sqlite3

def create_connect_database(db_name):
    """Opens connection or creates it if it is not existent"""
    connection = sqlite3.connect(db_name)
    cursor = connection.cursor()
    
    return connection, cursor

def commit_close(conn, c, close_connection=True):
    """Commits to connection DB and closes it if close is True"""
    conn.commit()

    if close_connection is True:
        c.close()
        conn.close()
    elif close_connection is False:
        pass

Who is most likely to receive a tip during weekday? A Female or a Male?

In [54]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("tips.db")

query0 = """SELECT day, sex, COUNT(*) as CTD
FROM tips 
GROUP BY day, sex;"""

df = pd.read_sql_query(query0, conn)
df.head(20)

    day     sex  CTD
0   Fri  Female    9
1   Fri    Male   10
2   Sat  Female   28
3   Sat    Male   59
4   Sun  Female   18
5   Sun    Male   58
6  Thur  Female   32
7  Thur    Male   30

**A Female is most likely to receive a tip**

In [53]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("tips.db")

query = """SELECT day, sex, COUNT(*) as CTD
FROM tips where day in ('Fri','Thur')
GROUP BY day, sex;"""

df = pd.read_sql_query(query, conn)
df.head(20)

    day     sex  CTD
0   Fri  Female    9
1   Fri    Male   10
2  Thur  Female   32
3  Thur    Male   30

In [58]:
conn, cursor = create_connect_database("tips.db")

query4 = """select a.sex,sum(a.ctd) as Tot from (SELECT day, sex, COUNT(*) as CTD
FROM tips where day in ('Fri','Thur')
GROUP BY day, sex) a group by a.sex;"""

df = pd.read_sql_query(query4, conn)
df.head(20)

      sex  Tot
0  Female   41
1    Male   40

And during weekends?

**A Male is most likely to receive a tip**

In [55]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("tips.db")

query3 = """SELECT day, sex, COUNT(*) as CTD
FROM tips where day in ('Sat','Sun')
GROUP BY day, sex;"""

df = pd.read_sql_query(query3, conn)
df.head(20)

   day     sex  CTD
0  Sat  Female   28
1  Sat    Male   59
2  Sun  Female   18
3  Sun    Male   58

In [57]:
conn, cursor = create_connect_database("tips.db")

query2 = """select a.sex,sum(a.ctd) as Tot from (SELECT day, sex, COUNT(*) as CTD
FROM tips where day in ('Sat','Sun')
GROUP BY day, sex) a group by a.sex;"""

df = pd.read_sql_query(query2, conn)
df.head(20)

      sex  Tot
0  Female   46
1    Male  117

What is the table size that is most likely to bring a better tip?

**Table size 6**

In [65]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("tips.db")

query = """SELECT size, AVG(tip) as Tip_avg, COUNT(*) as CTD,sum(tip) as Tip_sum
FROM tips
GROUP BY size order by AVG(tip) desc;"""

df2 = pd.read_sql_query(query, conn)
df2

   size   Tip_avg  CTD  Tip_sum
0     6  5.225000    4    20.90
1     4  4.135405   37   153.01
2     5  4.028000    5    20.14
3     3  3.393158   38   128.94
4     2  2.582308  156   402.84
5     1  1.437500    4     5.75

Who are giving more tips, smokers or non smokers?

**Non smokers**

In [69]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("tips.db")

query = """SELECT smoker, AVG(tip) avg_tips, COUNT(*) as ctd_tips
FROM tips
GROUP BY smoker;"""

df3 = pd.read_sql_query(query, conn)
df3

  smoker  avg_tips  ctd_tips
0     No  2.991854       151
1    Yes  3.008710        93

## More airports

For extra points, plot the routs of incoming/outgoing destinations using Geopandas

Download [this Sqlite database](https://github.com/vfp1/bts-dsf-2020/raw/main/data/flights.db)

Using SQLite database reply the following questions:

*   Which is the country that has the least amount of active airlines?
*   And which is the country that has the most amount of active airlines?
*   Which is the country that has more airports?
*   And the country with the least airports?
*   Which country has the most outgoing destinations? And the least?
*   And which country has the most incoming destinations? And the least?

In [70]:
import sqlite3

def create_connect_database(db_name):
    """Opens connection or creates it if it is not existent"""
    connection = sqlite3.connect(db_name)
    cursor = connection.cursor()
    
    return connection, cursor

def commit_close(conn, c, close_connection=True):
    """Commits to connection DB and closes it if close is True"""
    conn.commit()

    if close_connection is True:
        c.close()
        conn.close()
    elif close_connection is False:
        pass

In [71]:
!wget "https://github.com/vfp1/bts-mbds-data-science-foundations-2019/raw/master/sessions/data/flights.db"

--2020-11-05 16:00:51--  https://github.com/vfp1/bts-mbds-data-science-foundations-2019/raw/master/sessions/data/flights.db
Resolving github.com (github.com)... 140.82.114.3
Connecting to github.com (github.com)|140.82.114.3|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/vfp1/bts-mbds-data-science-foundations-2019/master/sessions/data/flights.db [following]
--2020-11-05 16:00:51--  https://raw.githubusercontent.com/vfp1/bts-mbds-data-science-foundations-2019/master/sessions/data/flights.db
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5415936 (5.2M) [application/octet-stream]
Saving to: flights.db

flights.db          100%[===================>]   5.17M  18.8MB/s    in 0.3s

2020-11-05 16:00:53 (18.8 MB/s) - flights.db saved [5415936/5415936]

In [73]:
import sqlite3

connection, cursor = create_connect_database('flights.db')

cursor.execute("SELECT name FROM SQLite_master WHERE type='table';")
tables = cursor.fetchall()
print(tables)

[('airports',), ('airlines',), ('routes',)]

**Which is the country that has the least amount of active airlines?**

In [80]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("flights.db")

query = """SELECT country,count(*) as qty FROM airlines WHERE active=='Y' group by country;"""

df = pd.read_sql_query(query, conn)
df.head(10)

               country  qty
0                 None    2
1                 S.A.    1
2               ALASKA    1
3              AVIANCA    1
4          Afghanistan    4
5              Albania    2
6              Algeria    2
7       American Samoa    1
8               Angola    2
9  Antigua and Barbuda    1

**And which is the country that has the most amount of active airlines? **

United States

In [90]:
df.sort_values('qty',ascending=False)

                   country  qty
185          United States  141
147                 Russia   72
184         United Kingdom   40
71                 Germany   37
37                  Canada   34
..                     ...  ...
44                 Comoros    1
40          Cayman Islands    1
160               Slovenia    1
161        Solomon Islands    1
152  Sao Tome and Principe    1

[195 rows x 2 columns]

**Which is the country that has more airports?**

United States

In [92]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("flights.db")

query = """SELECT country,count(*) as qty FROM airports group by country order by count(*) desc;"""

df2 = pd.read_sql_query(query, conn)
df2.head(5)

         country   qty
0  United States  1697
1         Canada   435
2        Germany   321
3      Australia   263
4         Russia   249

**And the country with the least airports?**

In [95]:
df2.sort_values('qty',ascending=True)

           country   qty
239      West Bank     1
210        Albania     1
211       Anguilla     1
212          Aruba     1
213       Barbados     1
..             ...   ...
4           Russia   249
3        Australia   263
2          Germany   321
1           Canada   435
0    United States  1697

[240 rows x 2 columns]

**Which country has the most outgoing destinations? And the least?**

In [101]:
import pandas as pd
import sqlite3

conn, cursor = create_connect_database("flights.db")

query = """SELECT 
CAST(source_air.country AS TEXT) AS source_country, 
CAST(destination_air.country AS TEXT) AS destination_country ,count(*) as qty
FROM routes 
INNER JOIN airports source_air 
  ON source_air.id = routes.source_id 
INNER JOIN airports destination_air 
  ON destination_air.id = routes.dest_id
  group by CAST(source_air.country AS TEXT),CAST(destination_air.country AS TEXT);"""

df3 = pd.read_sql_query(query, conn)
df3.head(5)

  source_country destination_country  qty
0    Afghanistan         Afghanistan   14
1    Afghanistan          Azerbaijan    1
2    Afghanistan               India    7
3    Afghanistan                Iran    5
4    Afghanistan              Kuwait    1

In [106]:
df3.groupby(['source_country']).agg('sum').sort_values('qty',ascending=False)

                           qty
source_country
United States            13178
China                     8146
United Kingdom            2661
Spain                     2530
Germany                   2353
...                        ...
Swaziland                    1
Cocos (Keeling) Islands      1
Tuvalu                       1
American Samoa               1
Niue                         1

[226 rows x 1 columns]

In [107]:
df3.groupby(['source_country']).agg('sum').sort_values('qty',ascending=True)

                           qty
source_country
American Samoa               1
Lesotho                      1
Niue                         1
Tuvalu                       1
Cocos (Keeling) Islands      1
...                        ...
Germany                   2353
Spain                     2530
United Kingdom            2661
China                     8146
United States            13178

[226 rows x 1 columns]

**And which country has the most incoming destinations? And the least?**

In [104]:
df3.groupby(['destination_country']).agg('sum').sort_values('qty',ascending=False)

                           qty
source_country
United States            13178
China                     8146
United Kingdom            2661
Spain                     2530
Germany                   2353
...                        ...
Swaziland                    1
Cocos (Keeling) Islands      1
Tuvalu                       1
American Samoa               1
Niue                         1

[226 rows x 1 columns]

In [105]:
df3.groupby(['destination_country']).agg('sum').sort_values('qty',ascending=True)

                           qty
source_country
American Samoa               1
Lesotho                      1
Niue                         1
Tuvalu                       1
Cocos (Keeling) Islands      1
...                        ...
Germany                   2353
Spain                     2530
United Kingdom            2661
China                     8146
United States            13178

[226 rows x 1 columns]

# Kaggle Titanic

Your first Kaggle challenge! 

Retrieve the csv (train) file from [this Kaggle challenge](https://www.kaggle.com/c/titanic/data?select=train.csv)

Either here or through a Kaggle notebook (you will need to submit then this notebook with the rest of exercises and the Kaggle notebook).

Reply to the following questions:



1.   How many men and women survived?
2.   What was the age group that had a higher survival chance? You can divide age groups in groups of 10 years
3. Which port of embarkation had most of the survivors? And which less?
4. Which ticket class had most of the survivors? And which less?
5. Could you compare the ticket fare with the survival? Did more expensive tickets had higher chance of surviving?

In [109]:
import pandas as pd
import numpy as np

titanic = pd.read_csv('train.csv')
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [160]:
titanic_port.value_counts

<bound method DataFrame.value_counts of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[889 rows x 12 columns]>

How many men and women survived?

In [124]:
titanic.groupby(['Sex']).agg({'Survived' :'sum'})

        Survived
Sex
female       233
male         109

What was the age group that had a higher survival chance? You can divide age groups in groups of 10 years

In [132]:
titanic['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [148]:
titanic_age = titanic.dropna(subset=['Age'])
titanic_age

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[714 rows x 12 columns]

In [154]:
# create a list of our conditions
conditions = [
    (titanic_age['Age'] <= 10),
    (titanic_age['Age'] > 10) & (titanic_age['Age'] <= 20),
    (titanic_age['Age'] > 20) & (titanic_age['Age'] <= 30),
    (titanic_age['Age'] > 30) & (titanic_age['Age'] <= 40),
    (titanic_age['Age'] > 40) & (titanic_age['Age'] <= 50),
    (titanic_age['Age'] > 50) & (titanic_age['Age'] <= 60),
    (titanic_age['Age'] > 60) & (titanic_age['Age'] <= 70),
    (titanic_age['Age'] > 70) & (titanic_age['Age'] <= 80),
    (titanic_age['Age'] > 80) & (titanic_age['Age'] <= 90),
    (titanic_age['Age'] > 90) & (titanic_age['Age'] <= 100),
    (titanic_age['Age'] > 100)
    ]

# create a list of the values we want to assign for each condition
values = ['[1-10]', '[10-20]', '[20-30]', '[30-40]', '[40-50]', '[50-60]', '[60-70]', '[70-80]', '[80-90]', '[90-100]', '[>100]']

# create a new column and use np.select to assign values to it using our lists as arguments
titanic_age['Group_Age'] = np.select(conditions, values)

# display updated DataFrame
titanic_age.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   PassengerId  Survived  Pclass  ... Cabin Embarked  Group_Age
0            1         0       3  ...   NaN        S    [20-30]
1            2         1       1  ...   C85        C    [30-40]
2            3         1       3  ...   NaN        S    [20-30]
3            4         1       1  ...  C123        S    [30-40]
4            5         0       3  ...   NaN        S    [30-40]

[5 rows x 13 columns]

**The group [1-10] Age had more chances**

In [188]:
titanic_age2 = titanic_age.groupby(['Group_Age']).agg({'Survived' :'sum','Ticket':'count'})
titanic_age2['%'] = titanic_age2.Survived*100 /titanic_age2.Ticket
titanic_age2.sort_values('%',ascending=False)

           Survived  Ticket          %
Group_Age
[1-10]           38      64  59.375000
[30-40]          69     155  44.516129
[50-60]          17      42  40.476190
[40-50]          33      86  38.372093
[10-20]          44     115  38.260870
[20-30]          84     230  36.521739
[60-70]           4      17  23.529412
[70-80]           1       5  20.000000

Which port of embarkation had most of the survivors? And which less?

In [156]:
titanic['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [162]:
titanic_port = titanic.dropna(subset=['Embarked'])
titanic_port.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [161]:
titanic_port['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

**Port S=Southampton Had most of the survivors, / Port Q=Queenstown had less of survivors.**

In [163]:
titanic_age.groupby(['Embarked']).agg({'Survived' :'sum'}).sort_values('Survived',ascending=False)

          Survived
Embarked
S              201
C               79
Q                8

Which ticket class had most of the survivors? And which less?

In [164]:
titanic['Pclass'].unique()

array([3, 1, 2])

          First-class Had most of the survivors, / Second-class Queenstown had less of survivors.

In [173]:
titanic.groupby(['Pclass']).agg({'Survived' :'sum'}).sort_values('Survived',ascending=False)

        Survived
Pclass
1            136
3            119
2             87

Could you compare the ticket fare with the survival? Did more expensive tickets had higher chance of surviving?

           **Yes, People who bought tickets to first class, had higher chances to survive **

In [189]:
titanic_tick = titanic.groupby(['Pclass']).agg({'Survived' :'sum','Fare':'mean','Ticket':'count'}).sort_values('Survived',ascending=False)
titanic_tick['%'] = titanic_tick.Survived*100 /titanic_tick.Ticket
titanic_tick

        Survived       Fare  Ticket          %
Pclass
1            136  84.154687     216  62.962963
3            119  13.675550     491  24.236253
2             87  20.662183     184  47.282609